In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('titanic_data.csv')

In [4]:
df = df.dropna()

In [5]:
print(df.head())

    survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
1          1       1  female  38.0      1      0  71.2833        C  First
3          1       1  female  35.0      1      0  53.1000        S  First
6          0       1    male  54.0      0      0  51.8625        S  First
10         1       3  female   4.0      1      1  16.7000        S  Third
11         1       1  female  58.0      0      0  26.5500        S  First

      who  adult_male deck  embark_town alive  alone
1   woman       False    C    Cherbourg   yes  False
3   woman       False    C  Southampton   yes  False
6     man        True    E  Southampton    no   True
10  child       False    G  Southampton   yes  False
11  woman       False    C  Southampton   yes   True

In [6]:
print(f"Dimension of the dataframe: {df.shape}")

Dimension of the dataframe: (182, 15)

In [7]:
print(f"Column names: {df.columns}")

Column names: Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [9]:
survived_by_class = df.groupby(['pclass'])['survived'].sum()
print(survived_by_class)

pclass
1    106
2     12
3      5
Name: survived, dtype: int64

In [10]:
average_fare_by_town = df.groupby(['embark_town'])['fare'].mean()
print(average_fare_by_town)

embark_town
Cherbourg      103.342503
Queenstown      90.000000
Southampton     64.922862
Name: fare, dtype: float64

In [11]:
average_fare_by_gender_and_town = df.groupby(['embark_town', 'sex'])['fare'].mean()
print(average_fare_by_gender_and_town)

embark_town  sex
Cherbourg    female    104.169609
             male      102.435355
Queenstown   female     90.000000
             male       90.000000
Southampton  female     79.251179
             male       52.674461
Name: fare, dtype: float64

In [12]:
average_fare_and_age_by_gender_and_town = df.groupby(['embark_town', 'sex'])[['fare', 'age']].mean()
print(average_fare_and_age_by_gender_and_town)

                          fare        age
embark_town sex
Cherbourg   female  104.169609  35.352941
            male    102.435355  39.774194
Queenstown  female   90.000000  33.000000
            male     90.000000  44.000000
Southampton female   79.251179  30.952830
            male     52.674461  37.595484